SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_rac.h
/* Bit fields for RAC PATRIM5 */
#define _RAC_PATRIM5_RESETVALUE                                       0x00181800UL                                         /**< Default value for RAC_PATRIM5               */
#define _RAC_PATRIM5_MASK                                             0x033F3F7FUL                                         /**< Mask for RAC_PATRIM5                        */
#define RAC_PATRIM5_TXPATRIMDACGLITCH                                 (0x1UL << 0)                                         /**< TXPATRIMDACGLITCH                           */
#define _RAC_PATRIM5_TXPATRIMDACGLITCH_SHIFT                          0                                                    /**< Shift value for RAC_TXPATRIMDACGLITCH       */
#define _RAC_PATRIM5_TXPATRIMDACGLITCH_MASK                           0x1UL                                                /**< Bit mask for RAC_TXPATRIMDACGLITCH          */
#define _RAC_PATRIM5_TXPATRIMDACGLITCH_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMDACGLITCH_larger_glitch                  0x00000000UL                                         /**< Mode larger_glitch for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMDACGLITCH_smaller_glitch                 0x00000001UL                                         /**< Mode smaller_glitch for RAC_PATRIM5         */
#define RAC_PATRIM5_TXPATRIMDACGLITCH_DEFAULT                         (_RAC_PATRIM5_TXPATRIMDACGLITCH_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMDACGLITCH_larger_glitch                   (_RAC_PATRIM5_TXPATRIMDACGLITCH_larger_glitch << 0)  /**< Shifted mode larger_glitch for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMDACGLITCH_smaller_glitch                  (_RAC_PATRIM5_TXPATRIMDACGLITCH_smaller_glitch << 0) /**< Shifted mode smaller_glitch for RAC_PATRIM5 */
#define _RAC_PATRIM5_TXPATRIMDLY0_SHIFT                               1                                                    /**< Shift value for RAC_TXPATRIMDLY0            */
#define _RAC_PATRIM5_TXPATRIMDLY0_MASK                                0xEUL                                                /**< Bit mask for RAC_TXPATRIMDLY0               */
#define _RAC_PATRIM5_TXPATRIMDLY0_DEFAULT                             0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_0ps                            0x00000000UL                                         /**< Mode tdly_0ps for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_64ps                           0x00000001UL                                         /**< Mode tdly_64ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_65ps                           0x00000002UL                                         /**< Mode tdly_65ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_66ps                           0x00000003UL                                         /**< Mode tdly_66ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_68ps                           0x00000004UL                                         /**< Mode tdly_68ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_70ps                           0x00000005UL                                         /**< Mode tdly_70ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_75ps                           0x00000006UL                                         /**< Mode tdly_75ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY0_tdly_83ps                           0x00000007UL                                         /**< Mode tdly_83ps for RAC_PATRIM5              */
#define RAC_PATRIM5_TXPATRIMDLY0_DEFAULT                              (_RAC_PATRIM5_TXPATRIMDLY0_DEFAULT << 1)             /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_0ps                             (_RAC_PATRIM5_TXPATRIMDLY0_tdly_0ps << 1)            /**< Shifted mode tdly_0ps for RAC_PATRIM5       */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_64ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_64ps << 1)           /**< Shifted mode tdly_64ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_65ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_65ps << 1)           /**< Shifted mode tdly_65ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_66ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_66ps << 1)           /**< Shifted mode tdly_66ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_68ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_68ps << 1)           /**< Shifted mode tdly_68ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_70ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_70ps << 1)           /**< Shifted mode tdly_70ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_75ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_75ps << 1)           /**< Shifted mode tdly_75ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY0_tdly_83ps                            (_RAC_PATRIM5_TXPATRIMDLY0_tdly_83ps << 1)           /**< Shifted mode tdly_83ps for RAC_PATRIM5      */
#define _RAC_PATRIM5_TXPATRIMDLY1_SHIFT                               4                                                    /**< Shift value for RAC_TXPATRIMDLY1            */
#define _RAC_PATRIM5_TXPATRIMDLY1_MASK                                0x70UL                                               /**< Bit mask for RAC_TXPATRIMDLY1               */
#define _RAC_PATRIM5_TXPATRIMDLY1_DEFAULT                             0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_0ps                            0x00000000UL                                         /**< Mode tdly_0ps for RAC_PATRIM5               */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_64ps                           0x00000001UL                                         /**< Mode tdly_64ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_65ps                           0x00000002UL                                         /**< Mode tdly_65ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_66ps                           0x00000003UL                                         /**< Mode tdly_66ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_68ps                           0x00000004UL                                         /**< Mode tdly_68ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_70ps                           0x00000005UL                                         /**< Mode tdly_70ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_75ps                           0x00000006UL                                         /**< Mode tdly_75ps for RAC_PATRIM5              */
#define _RAC_PATRIM5_TXPATRIMDLY1_tdly_83ps                           0x00000007UL                                         /**< Mode tdly_83ps for RAC_PATRIM5              */
#define RAC_PATRIM5_TXPATRIMDLY1_DEFAULT                              (_RAC_PATRIM5_TXPATRIMDLY1_DEFAULT << 4)             /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_0ps                             (_RAC_PATRIM5_TXPATRIMDLY1_tdly_0ps << 4)            /**< Shifted mode tdly_0ps for RAC_PATRIM5       */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_64ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_64ps << 4)           /**< Shifted mode tdly_64ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_65ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_65ps << 4)           /**< Shifted mode tdly_65ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_66ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_66ps << 4)           /**< Shifted mode tdly_66ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_68ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_68ps << 4)           /**< Shifted mode tdly_68ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_70ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_70ps << 4)           /**< Shifted mode tdly_70ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_75ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_75ps << 4)           /**< Shifted mode tdly_75ps for RAC_PATRIM5      */
#define RAC_PATRIM5_TXPATRIMDLY1_tdly_83ps                            (_RAC_PATRIM5_TXPATRIMDLY1_tdly_83ps << 4)           /**< Shifted mode tdly_83ps for RAC_PATRIM5      */
#define _RAC_PATRIM5_TXPATRIMNBIAS_SHIFT                              8                                                    /**< Shift value for RAC_TXPATRIMNBIAS           */
#define _RAC_PATRIM5_TXPATRIMNBIAS_MASK                               0xF00UL                                              /**< Bit mask for RAC_TXPATRIMNBIAS              */
#define _RAC_PATRIM5_TXPATRIMNBIAS_DEFAULT                            0x00000008UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn104mv                     0x00000000UL                                         /**< Mode vnbias_dn104mv for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn91mv                      0x00000001UL                                         /**< Mode vnbias_dn91mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn78mv                      0x00000002UL                                         /**< Mode vnbias_dn78mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn65mv                      0x00000003UL                                         /**< Mode vnbias_dn65mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn52mv                      0x00000004UL                                         /**< Mode vnbias_dn52mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn39mv                      0x00000005UL                                         /**< Mode vnbias_dn39mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn26mv                      0x00000006UL                                         /**< Mode vnbias_dn26mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn13mv                      0x00000007UL                                         /**< Mode vnbias_dn13mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_default                     0x00000008UL                                         /**< Mode vnbias_default for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up13mv                      0x00000009UL                                         /**< Mode vnbias_up13mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up26mv                      0x0000000AUL                                         /**< Mode vnbias_up26mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up39mv                      0x0000000BUL                                         /**< Mode vnbias_up39mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up52mv                      0x0000000CUL                                         /**< Mode vnbias_up52mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up65mv                      0x0000000DUL                                         /**< Mode vnbias_up65mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up78mv                      0x0000000EUL                                         /**< Mode vnbias_up78mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up91mv                      0x0000000FUL                                         /**< Mode vnbias_up91mv for RAC_PATRIM5          */
#define RAC_PATRIM5_TXPATRIMNBIAS_DEFAULT                             (_RAC_PATRIM5_TXPATRIMNBIAS_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn104mv                      (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn104mv << 8)     /**< Shifted mode vnbias_dn104mv for RAC_PATRIM5 */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn91mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn91mv << 8)      /**< Shifted mode vnbias_dn91mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn78mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn78mv << 8)      /**< Shifted mode vnbias_dn78mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn65mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn65mv << 8)      /**< Shifted mode vnbias_dn65mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn52mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn52mv << 8)      /**< Shifted mode vnbias_dn52mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn39mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn39mv << 8)      /**< Shifted mode vnbias_dn39mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn26mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn26mv << 8)      /**< Shifted mode vnbias_dn26mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn13mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_dn13mv << 8)      /**< Shifted mode vnbias_dn13mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_default                      (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_default << 8)     /**< Shifted mode vnbias_default for RAC_PATRIM5 */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up13mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up13mv << 8)      /**< Shifted mode vnbias_up13mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up26mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up26mv << 8)      /**< Shifted mode vnbias_up26mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up39mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up39mv << 8)      /**< Shifted mode vnbias_up39mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up52mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up52mv << 8)      /**< Shifted mode vnbias_up52mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up65mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up65mv << 8)      /**< Shifted mode vnbias_up65mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up78mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up78mv << 8)      /**< Shifted mode vnbias_up78mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up91mv                       (_RAC_PATRIM5_TXPATRIMNBIAS_vnbias_up91mv << 8)      /**< Shifted mode vnbias_up91mv for RAC_PATRIM5  */
#define _RAC_PATRIM5_TXPATRIMNCASC_SHIFT                              12                                                   /**< Shift value for RAC_TXPATRIMNCASC           */
#define _RAC_PATRIM5_TXPATRIMNCASC_MASK                               0x3000UL                                             /**< Bit mask for RAC_TXPATRIMNCASC              */
#define _RAC_PATRIM5_TXPATRIMNCASC_DEFAULT                            0x00000001UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMNCASC_ncbias_m50mv                       0x00000000UL                                         /**< Mode ncbias_m50mv for RAC_PATRIM5           */
#define _RAC_PATRIM5_TXPATRIMNCASC_ncbiasdefault                      0x00000001UL                                         /**< Mode ncbiasdefault for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMNCASC_ncbias_p50mv                       0x00000002UL                                         /**< Mode ncbias_p50mv for RAC_PATRIM5           */
#define _RAC_PATRIM5_TXPATRIMNCASC_ncbias_p100mv                      0x00000003UL                                         /**< Mode ncbias_p100mv for RAC_PATRIM5          */
#define RAC_PATRIM5_TXPATRIMNCASC_DEFAULT                             (_RAC_PATRIM5_TXPATRIMNCASC_DEFAULT << 12)           /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMNCASC_ncbias_m50mv                        (_RAC_PATRIM5_TXPATRIMNCASC_ncbias_m50mv << 12)      /**< Shifted mode ncbias_m50mv for RAC_PATRIM5   */
#define RAC_PATRIM5_TXPATRIMNCASC_ncbiasdefault                       (_RAC_PATRIM5_TXPATRIMNCASC_ncbiasdefault << 12)     /**< Shifted mode ncbiasdefault for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMNCASC_ncbias_p50mv                        (_RAC_PATRIM5_TXPATRIMNCASC_ncbias_p50mv << 12)      /**< Shifted mode ncbias_p50mv for RAC_PATRIM5   */
#define RAC_PATRIM5_TXPATRIMNCASC_ncbias_p100mv                       (_RAC_PATRIM5_TXPATRIMNCASC_ncbias_p100mv << 12)     /**< Shifted mode ncbias_p100mv for RAC_PATRIM5  */
#define _RAC_PATRIM5_TXPATRIMPBIAS_SHIFT                              16                                                   /**< Shift value for RAC_TXPATRIMPBIAS           */
#define _RAC_PATRIM5_TXPATRIMPBIAS_MASK                               0xF0000UL                                            /**< Bit mask for RAC_TXPATRIMPBIAS              */
#define _RAC_PATRIM5_TXPATRIMPBIAS_DEFAULT                            0x00000008UL                                         /**< Mode DEFAULT for RAC_PATRIM5                */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up104mv                     0x00000000UL                                         /**< Mode vpbias_up104mv for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up91mv                      0x00000001UL                                         /**< Mode vpbias_up91mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up78mv                      0x00000002UL                                         /**< Mode vpbias_up78mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up65mv                      0x00000003UL                                         /**< Mode vpbias_up65mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up52mv                      0x00000004UL                                         /**< Mode vpbias_up52mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up39mv                      0x00000005UL                                         /**< Mode vpbias_up39mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up26mv                      0x00000006UL                                         /**< Mode vpbias_up26mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up13mv                      0x00000007UL                                         /**< Mode vpbias_up13mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_default                     0x00000008UL                                         /**< Mode vpbias_default for RAC_PATRIM5         */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn13mv                      0x00000009UL                                         /**< Mode vpbias_dn13mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn26mv                      0x0000000AUL                                         /**< Mode vpbias_dn26mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn38mv                      0x0000000BUL                                         /**< Mode vpbias_dn38mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn52mv                      0x0000000CUL                                         /**< Mode vpbias_dn52mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn65mv                      0x0000000DUL                                         /**< Mode vpbias_dn65mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn78mv                      0x0000000EUL                                         /**< Mode vpbias_dn78mv for RAC_PATRIM5          */
#define _RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn91mv                      0x0000000FUL                                         /**< Mode vpbias_dn91mv for RAC_PATRIM5          */
#define RAC_PATRIM5_TXPATRIMPBIAS_DEFAULT                             (_RAC_PATRIM5_TXPATRIMPBIAS_DEFAULT << 16)           /**< Shifted mode DEFAULT for RAC_PATRIM5        */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up104mv                      (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up104mv << 16)    /**< Shifted mode vpbias_up104mv for RAC_PATRIM5 */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up91mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up91mv << 16)     /**< Shifted mode vpbias_up91mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up78mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up78mv << 16)     /**< Shifted mode vpbias_up78mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up65mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up65mv << 16)     /**< Shifted mode vpbias_up65mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up52mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up52mv << 16)     /**< Shifted mode vpbias_up52mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up39mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up39mv << 16)     /**< Shifted mode vpbias_up39mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up26mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up26mv << 16)     /**< Shifted mode vpbias_up26mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up13mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_up13mv << 16)     /**< Shifted mode vpbias_up13mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_default                      (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_default << 16)    /**< Shifted mode vpbias_default for RAC_PATRIM5 */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn13mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn13mv << 16)     /**< Shifted mode vpbias_dn13mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn26mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn26mv << 16)     /**< Shifted mode vpbias_dn26mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn38mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn38mv << 16)     /**< Shifted mode vpbias_dn38mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn52mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn52mv << 16)     /**< Shifted mode vpbias_dn52mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn65mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn65mv << 16)     /**< Shifted mode vpbias_dn65mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn78mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn78mv << 16)     /**< Shifted mode vpbias_dn78mv for RAC_PATRIM5  */
#define RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn91mv                       (_RAC_PATRIM5_TXPATRIMPBIAS_vpbias_dn91mv << 16)     /**< Shifted mode vpbias_dn91mv for RAC_PATRIM5  */
#define _RAC_PATRIM5_TXPATRIMPCASC_SHIFT                              20                                                   /**< Shift value for RAC_TXPATRIMPCASC           */
