SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_rac.h
#define _RAC_TX_SYPFDCHPLPENTX_MASK                                   0x20000UL                                         /**< Bit mask for RAC_SYPFDCHPLPENTX             */
#define _RAC_TX_SYPFDCHPLPENTX_DEFAULT                                0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_disable                                0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_enable                                 0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDCHPLPENTX_DEFAULT                                 (_RAC_TX_SYPFDCHPLPENTX_DEFAULT << 17)            /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_disable                                 (_RAC_TX_SYPFDCHPLPENTX_disable << 17)            /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_enable                                  (_RAC_TX_SYPFDCHPLPENTX_enable << 17)             /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYPFDFPWENTX                                           (0x1UL << 18)                                     /**< SYPFDFPWENTX                                */
#define _RAC_TX_SYPFDFPWENTX_SHIFT                                    18                                                /**< Shift value for RAC_SYPFDFPWENTX            */
#define _RAC_TX_SYPFDFPWENTX_MASK                                     0x40000UL                                         /**< Bit mask for RAC_SYPFDFPWENTX               */
#define _RAC_TX_SYPFDFPWENTX_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_disable                                  0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_enable                                   0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDFPWENTX_DEFAULT                                   (_RAC_TX_SYPFDFPWENTX_DEFAULT << 18)              /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_disable                                   (_RAC_TX_SYPFDFPWENTX_disable << 18)              /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_enable                                    (_RAC_TX_SYPFDFPWENTX_enable << 18)               /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN10DBM                                            (0x1UL << 19)                                     /**< TXPAEN10DBM                                 */
#define _RAC_TX_TXPAEN10DBM_SHIFT                                     19                                                /**< Shift value for RAC_TXPAEN10DBM             */
#define _RAC_TX_TXPAEN10DBM_MASK                                      0x80000UL                                         /**< Bit mask for RAC_TXPAEN10DBM                */
#define _RAC_TX_TXPAEN10DBM_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBM_disable                                   0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBM_enable                                    0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN10DBM_DEFAULT                                    (_RAC_TX_TXPAEN10DBM_DEFAULT << 19)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN10DBM_disable                                    (_RAC_TX_TXPAEN10DBM_disable << 19)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN10DBM_enable                                     (_RAC_TX_TXPAEN10DBM_enable << 19)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN10DBMMAINCTAP                                    (0x1UL << 20)                                     /**< TXPAEN10DBMMAINCTAP                         */
#define _RAC_TX_TXPAEN10DBMMAINCTAP_SHIFT                             20                                                /**< Shift value for RAC_TXPAEN10DBMMAINCTAP     */
#define _RAC_TX_TXPAEN10DBMMAINCTAP_MASK                              0x100000UL                                        /**< Bit mask for RAC_TXPAEN10DBMMAINCTAP        */
#define _RAC_TX_TXPAEN10DBMMAINCTAP_DEFAULT                           0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_dis                     0x00000000UL                                      /**< Mode ctap_main_dis for RAC_TX               */
#define _RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_en                      0x00000001UL                                      /**< Mode ctap_main_en for RAC_TX                */
#define RAC_TX_TXPAEN10DBMMAINCTAP_DEFAULT                            (_RAC_TX_TXPAEN10DBMMAINCTAP_DEFAULT << 20)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_dis                      (_RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_dis << 20) /**< Shifted mode ctap_main_dis for RAC_TX       */
#define RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_en                       (_RAC_TX_TXPAEN10DBMMAINCTAP_ctap_main_en << 20)  /**< Shifted mode ctap_main_en for RAC_TX        */
#define RAC_TX_TXPAEN10DBMPREDRV                                      (0x1UL << 21)                                     /**< TXPAEN10DBMPREDRV                           */
#define _RAC_TX_TXPAEN10DBMPREDRV_SHIFT                               21                                                /**< Shift value for RAC_TXPAEN10DBMPREDRV       */
#define _RAC_TX_TXPAEN10DBMPREDRV_MASK                                0x200000UL                                        /**< Bit mask for RAC_TXPAEN10DBMPREDRV          */
#define _RAC_TX_TXPAEN10DBMPREDRV_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBMPREDRV_disable                             0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBMPREDRV_enable                              0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN10DBMPREDRV_DEFAULT                              (_RAC_TX_TXPAEN10DBMPREDRV_DEFAULT << 21)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN10DBMPREDRV_disable                              (_RAC_TX_TXPAEN10DBMPREDRV_disable << 21)         /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN10DBMPREDRV_enable                               (_RAC_TX_TXPAEN10DBMPREDRV_enable << 21)          /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN10DBMVMID                                        (0x1UL << 22)                                     /**< TXPAEN10DBMVMID                             */
#define _RAC_TX_TXPAEN10DBMVMID_SHIFT                                 22                                                /**< Shift value for RAC_TXPAEN10DBMVMID         */
#define _RAC_TX_TXPAEN10DBMVMID_MASK                                  0x400000UL                                        /**< Bit mask for RAC_TXPAEN10DBMVMID            */
#define _RAC_TX_TXPAEN10DBMVMID_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBMVMID_disable                               0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN10DBMVMID_enable                                0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN10DBMVMID_DEFAULT                                (_RAC_TX_TXPAEN10DBMVMID_DEFAULT << 22)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN10DBMVMID_disable                                (_RAC_TX_TXPAEN10DBMVMID_disable << 22)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN10DBMVMID_enable                                 (_RAC_TX_TXPAEN10DBMVMID_enable << 22)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN20DBM                                            (0x1UL << 23)                                     /**< TXPAEN20DBM                                 */
#define _RAC_TX_TXPAEN20DBM_SHIFT                                     23                                                /**< Shift value for RAC_TXPAEN20DBM             */
#define _RAC_TX_TXPAEN20DBM_MASK                                      0x800000UL                                        /**< Bit mask for RAC_TXPAEN20DBM                */
#define _RAC_TX_TXPAEN20DBM_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBM_disable                                   0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBM_enable                                    0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN20DBM_DEFAULT                                    (_RAC_TX_TXPAEN20DBM_DEFAULT << 23)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN20DBM_disable                                    (_RAC_TX_TXPAEN20DBM_disable << 23)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN20DBM_enable                                     (_RAC_TX_TXPAEN20DBM_enable << 23)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN20DBMMAINCTAP                                    (0x1UL << 24)                                     /**< TXPAEN20DBMMAINCTAP                         */
#define _RAC_TX_TXPAEN20DBMMAINCTAP_SHIFT                             24                                                /**< Shift value for RAC_TXPAEN20DBMMAINCTAP     */
#define _RAC_TX_TXPAEN20DBMMAINCTAP_MASK                              0x1000000UL                                       /**< Bit mask for RAC_TXPAEN20DBMMAINCTAP        */
#define _RAC_TX_TXPAEN20DBMMAINCTAP_DEFAULT                           0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_dis                     0x00000000UL                                      /**< Mode ctap_main_dis for RAC_TX               */
#define _RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_en                      0x00000001UL                                      /**< Mode ctap_main_en for RAC_TX                */
#define RAC_TX_TXPAEN20DBMMAINCTAP_DEFAULT                            (_RAC_TX_TXPAEN20DBMMAINCTAP_DEFAULT << 24)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_dis                      (_RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_dis << 24) /**< Shifted mode ctap_main_dis for RAC_TX       */
#define RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_en                       (_RAC_TX_TXPAEN20DBMMAINCTAP_ctap_main_en << 24)  /**< Shifted mode ctap_main_en for RAC_TX        */
#define RAC_TX_TXPAEN20DBMPREDRV                                      (0x1UL << 25)                                     /**< TXPAEN20DBMPREDRV                           */
#define _RAC_TX_TXPAEN20DBMPREDRV_SHIFT                               25                                                /**< Shift value for RAC_TXPAEN20DBMPREDRV       */
#define _RAC_TX_TXPAEN20DBMPREDRV_MASK                                0x2000000UL                                       /**< Bit mask for RAC_TXPAEN20DBMPREDRV          */
#define _RAC_TX_TXPAEN20DBMPREDRV_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMPREDRV_disable                             0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMPREDRV_enable                              0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN20DBMPREDRV_DEFAULT                              (_RAC_TX_TXPAEN20DBMPREDRV_DEFAULT << 25)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN20DBMPREDRV_disable                              (_RAC_TX_TXPAEN20DBMPREDRV_disable << 25)         /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN20DBMPREDRV_enable                               (_RAC_TX_TXPAEN20DBMPREDRV_enable << 25)          /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN20DBMVMID                                        (0x1UL << 26)                                     /**< TXPAEN20DBMVMID                             */
#define _RAC_TX_TXPAEN20DBMVMID_SHIFT                                 26                                                /**< Shift value for RAC_TXPAEN20DBMVMID         */
#define _RAC_TX_TXPAEN20DBMVMID_MASK                                  0x4000000UL                                       /**< Bit mask for RAC_TXPAEN20DBMVMID            */
#define _RAC_TX_TXPAEN20DBMVMID_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMVMID_disable                               0x00000000UL                                      /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMVMID_enable                                0x00000001UL                                      /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXPAEN20DBMVMID_DEFAULT                                (_RAC_TX_TXPAEN20DBMVMID_DEFAULT << 26)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN20DBMVMID_disable                                (_RAC_TX_TXPAEN20DBMVMID_disable << 26)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXPAEN20DBMVMID_enable                                 (_RAC_TX_TXPAEN20DBMVMID_enable << 26)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXPAEN20DBMVBIASHF                                     (0x1UL << 27)                                     /**< TXPAEN20DBMVBIASHF                          */
#define _RAC_TX_TXPAEN20DBMVBIASHF_SHIFT                              27                                                /**< Shift value for RAC_TXPAEN20DBMVBIASHF      */
#define _RAC_TX_TXPAEN20DBMVBIASHF_MASK                               0x8000000UL                                       /**< Bit mask for RAC_TXPAEN20DBMVBIASHF         */
#define _RAC_TX_TXPAEN20DBMVBIASHF_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPAEN20DBMVBIASHF_disable_bias                       0x00000000UL                                      /**< Mode disable_bias for RAC_TX                */
#define _RAC_TX_TXPAEN20DBMVBIASHF_enable_bias                        0x00000001UL                                      /**< Mode enable_bias for RAC_TX                 */
#define RAC_TX_TXPAEN20DBMVBIASHF_DEFAULT                             (_RAC_TX_TXPAEN20DBMVBIASHF_DEFAULT << 27)        /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPAEN20DBMVBIASHF_disable_bias                        (_RAC_TX_TXPAEN20DBMVBIASHF_disable_bias << 27)   /**< Shifted mode disable_bias for RAC_TX        */
#define RAC_TX_TXPAEN20DBMVBIASHF_enable_bias                         (_RAC_TX_TXPAEN20DBMVBIASHF_enable_bias << 27)    /**< Shifted mode enable_bias for RAC_TX         */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_SHIFT                            28                                                /**< Shift value for RAC_TXPATRIM20DBMVBIASHF    */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_MASK                             0x30000000UL                                      /**< Bit mask for RAC_TXPATRIM20DBMVBIASHF       */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_DEFAULT                          0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_bias_avss                        0x00000000UL                                      /**< Mode bias_avss for RAC_TX                   */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_bias_low                         0x00000001UL                                      /**< Mode bias_low for RAC_TX                    */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_bias_mid                         0x00000002UL                                      /**< Mode bias_mid for RAC_TX                    */
#define _RAC_TX_TXPATRIM20DBMVBIASHF_bias_high                        0x00000003UL                                      /**< Mode bias_high for RAC_TX                   */
#define RAC_TX_TXPATRIM20DBMVBIASHF_DEFAULT                           (_RAC_TX_TXPATRIM20DBMVBIASHF_DEFAULT << 28)      /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXPATRIM20DBMVBIASHF_bias_avss                         (_RAC_TX_TXPATRIM20DBMVBIASHF_bias_avss << 28)    /**< Shifted mode bias_avss for RAC_TX           */
#define RAC_TX_TXPATRIM20DBMVBIASHF_bias_low                          (_RAC_TX_TXPATRIM20DBMVBIASHF_bias_low << 28)     /**< Shifted mode bias_low for RAC_TX            */
#define RAC_TX_TXPATRIM20DBMVBIASHF_bias_mid                          (_RAC_TX_TXPATRIM20DBMVBIASHF_bias_mid << 28)     /**< Shifted mode bias_mid for RAC_TX            */
#define RAC_TX_TXPATRIM20DBMVBIASHF_bias_high                         (_RAC_TX_TXPATRIM20DBMVBIASHF_bias_high << 28)    /**< Shifted mode bias_high for RAC_TX           */
#define RAC_TX_ENPAPOWER                                              (0x1UL << 30)                                     /**< Override                                    */
#define _RAC_TX_ENPAPOWER_SHIFT                                       30                                                /**< Shift value for RAC_ENPAPOWER               */
#define _RAC_TX_ENPAPOWER_MASK                                        0x40000000UL                                      /**< Bit mask for RAC_ENPAPOWER                  */
#define _RAC_TX_ENPAPOWER_DEFAULT                                     0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPAPOWER_DEFAULT                                      (_RAC_TX_ENPAPOWER_DEFAULT << 30)                 /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_ENPASELSLICE                                           (0x1UL << 31)                                     /**< Override                                    */
#define _RAC_TX_ENPASELSLICE_SHIFT                                    31                                                /**< Shift value for RAC_ENPASELSLICE            */
#define _RAC_TX_ENPASELSLICE_MASK                                     0x80000000UL                                      /**< Bit mask for RAC_ENPASELSLICE               */
#define _RAC_TX_ENPASELSLICE_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPASELSLICE_DEFAULT                                   (_RAC_TX_ENPASELSLICE_DEFAULT << 31)              /**< Shifted mode DEFAULT for RAC_TX             */

