SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_rac.h
/* Bit fields for RAC FENOTCH1 */
#define _RAC_FENOTCH1_RESETVALUE                                      0x00000000UL                                     /**< Default value for RAC_FENOTCH1              */
#define _RAC_FENOTCH1_MASK                                            0x001FFF05UL                                     /**< Mask for RAC_FENOTCH1                       */
#define RAC_FENOTCH1_FENOTCHENVDDSW                                   (0x1UL << 0)                                     /**< FENOTCHENVDDSW                              */
#define _RAC_FENOTCH1_FENOTCHENVDDSW_SHIFT                            0                                                /**< Shift value for RAC_FENOTCHENVDDSW          */
#define _RAC_FENOTCH1_FENOTCHENVDDSW_MASK                             0x1UL                                            /**< Bit mask for RAC_FENOTCHENVDDSW             */
#define _RAC_FENOTCH1_FENOTCHENVDDSW_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for RAC_FENOTCH1               */
#define _RAC_FENOTCH1_FENOTCHENVDDSW_disable                          0x00000000UL                                     /**< Mode disable for RAC_FENOTCH1               */
#define _RAC_FENOTCH1_FENOTCHENVDDSW_enable                           0x00000001UL                                     /**< Mode enable for RAC_FENOTCH1                */
#define RAC_FENOTCH1_FENOTCHENVDDSW_DEFAULT                           (_RAC_FENOTCH1_FENOTCHENVDDSW_DEFAULT << 0)      /**< Shifted mode DEFAULT for RAC_FENOTCH1       */
#define RAC_FENOTCH1_FENOTCHENVDDSW_disable                           (_RAC_FENOTCH1_FENOTCHENVDDSW_disable << 0)      /**< Shifted mode disable for RAC_FENOTCH1       */
#define RAC_FENOTCH1_FENOTCHENVDDSW_enable                            (_RAC_FENOTCH1_FENOTCHENVDDSW_enable << 0)       /**< Shifted mode enable for RAC_FENOTCH1        */
#define RAC_FENOTCH1_FENOTCHRCCALEN                                   (0x1UL << 2)                                     /**< FENOTCHRCCALEN                              */
#define _RAC_FENOTCH1_FENOTCHRCCALEN_SHIFT                            2                                                /**< Shift value for RAC_FENOTCHRCCALEN          */
#define _RAC_FENOTCH1_FENOTCHRCCALEN_MASK                             0x4UL                                            /**< Bit mask for RAC_FENOTCHRCCALEN             */
#define _RAC_FENOTCH1_FENOTCHRCCALEN_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for RAC_FENOTCH1               */
#define _RAC_FENOTCH1_FENOTCHRCCALEN_disable                          0x00000000UL                                     /**< Mode disable for RAC_FENOTCH1               */
#define _RAC_FENOTCH1_FENOTCHRCCALEN_enable                           0x00000001UL                                     /**< Mode enable for RAC_FENOTCH1                */
#define RAC_FENOTCH1_FENOTCHRCCALEN_DEFAULT                           (_RAC_FENOTCH1_FENOTCHRCCALEN_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_FENOTCH1       */
#define RAC_FENOTCH1_FENOTCHRCCALEN_disable                           (_RAC_FENOTCH1_FENOTCHRCCALEN_disable << 2)      /**< Shifted mode disable for RAC_FENOTCH1       */
#define RAC_FENOTCH1_FENOTCHRCCALEN_enable                            (_RAC_FENOTCH1_FENOTCHRCCALEN_enable << 2)       /**< Shifted mode enable for RAC_FENOTCH1        */
#define _RAC_FENOTCH1_FENOTCHRCCALCOUNTER_SHIFT                       8                                                /**< Shift value for RAC_FENOTCHRCCALCOUNTER     */
#define _RAC_FENOTCH1_FENOTCHRCCALCOUNTER_MASK                        0xFF00UL                                         /**< Bit mask for RAC_FENOTCHRCCALCOUNTER        */
#define _RAC_FENOTCH1_FENOTCHRCCALCOUNTER_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for RAC_FENOTCH1               */
#define RAC_FENOTCH1_FENOTCHRCCALCOUNTER_DEFAULT                      (_RAC_FENOTCH1_FENOTCHRCCALCOUNTER_DEFAULT << 8) /**< Shifted mode DEFAULT for RAC_FENOTCH1       */
#define _RAC_FENOTCH1_FENOTCHRCCALOSC_SHIFT                           16                                               /**< Shift value for RAC_FENOTCHRCCALOSC         */
#define _RAC_FENOTCH1_FENOTCHRCCALOSC_MASK                            0xF0000UL                                        /**< Bit mask for RAC_FENOTCHRCCALOSC            */
#define _RAC_FENOTCH1_FENOTCHRCCALOSC_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for RAC_FENOTCH1               */
#define RAC_FENOTCH1_FENOTCHRCCALOSC_DEFAULT                          (_RAC_FENOTCH1_FENOTCHRCCALOSC_DEFAULT << 16)    /**< Shifted mode DEFAULT for RAC_FENOTCH1       */
#define RAC_FENOTCH1_FENOTCHRCCALOUT                                  (0x1UL << 20)                                    /**< FENOTCHRCCALOUT                             */
#define _RAC_FENOTCH1_FENOTCHRCCALOUT_SHIFT                           20                                               /**< Shift value for RAC_FENOTCHRCCALOUT         */
#define _RAC_FENOTCH1_FENOTCHRCCALOUT_MASK                            0x100000UL                                       /**< Bit mask for RAC_FENOTCHRCCALOUT            */
#define _RAC_FENOTCH1_FENOTCHRCCALOUT_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for RAC_FENOTCH1               */
#define RAC_FENOTCH1_FENOTCHRCCALOUT_DEFAULT                          (_RAC_FENOTCH1_FENOTCHRCCALOUT_DEFAULT << 20)    /**< Shifted mode DEFAULT for RAC_FENOTCH1       */

/* Bit fields for RAC SCRATCH0 */
#define _RAC_SCRATCH0_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH0              */
#define _RAC_SCRATCH0_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH0                       */
#define _RAC_SCRATCH0_SCRATCH0_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH0                */
#define _RAC_SCRATCH0_SCRATCH0_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH0                   */
#define _RAC_SCRATCH0_SCRATCH0_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH0               */
#define RAC_SCRATCH0_SCRATCH0_DEFAULT                                 (_RAC_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH0       */

/* Bit fields for RAC SCRATCH1 */
#define _RAC_SCRATCH1_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_SCRATCH1              */
#define _RAC_SCRATCH1_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH1                       */
#define _RAC_SCRATCH1_SCRATCH1_SHIFT                                  0                                     /**< Shift value for RAC_SCRATCH1                */
#define _RAC_SCRATCH1_SCRATCH1_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH1                   */
#define _RAC_SCRATCH1_SCRATCH1_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH1               */
#define RAC_SCRATCH1_SCRATCH1_DEFAULT                                 (_RAC_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH1       */

